Revit 2027 API
BuiltInFailures.MEPCalculationFailures.Network_NoInputNode Property
 The calculation could not be executed as configured. Select an input node before analyzing this network.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId Network_NoInputNode { get; }
Public Shared ReadOnly Property Network_NoInputNode As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ Network_NoInputNode {
	FailureDefinitionId^ get ();
}
static member Network_NoInputNode : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.MEPCalculationFailures Class
Autodesk.Revit.DB Namespace